## Dictionary

In [1]:
person = {
    'first_name': 'Ali',
    'last_name': 'Bumi',
    'age': 18
}

In [15]:
print(person)

{'first_name': 'Ali', 'last_name': 'Bumi', 'age': 18}

In [16]:
type(person)

dict

In [6]:
people = {
    'first_name': ['Ali', 'Raib', 'Seli'],
    'last_name': ['Bumi', 'Bulan', 'Matahari'],
    'age': [18, 18, 18]
}

In [14]:
people

{'first_name': ['Ali', 'Raib', 'Seli'],
 'last_name': ['Bumi', 'Bulan', 'Matahari'],
 'age': [18, 18, 18]}

In [18]:
type(people)

dict

## Data Frame (rows x columns)

In [20]:
import pandas as pd

In [22]:
df = pd.DataFrame(people)

In [23]:
df

  first_name last_name  age
0        Ali      Bumi   18
1       Raib     Bulan   18
2       Seli  Matahari   18

In [25]:
type(df)

pandas.core.frame.DataFrame

## Series (rows x one column)

In [24]:
df['first_name']

0     Ali
1    Raib
2    Seli
Name: first_name, dtype: object

In [26]:
type(df['first_name'])

pandas.core.series.Series

In [27]:
df.first_name

0     Ali
1    Raib
2    Seli
Name: first_name, dtype: object

In [28]:
df.count

<bound method DataFrame.count of   first_name last_name  age
0        Ali      Bumi   18
1       Raib     Bulan   18
2       Seli  Matahari   18>

## Multiple Series -> Data Frame

In [29]:
df[['first_name', 'last_name']]

  first_name last_name
0        Ali      Bumi
1       Raib     Bulan
2       Seli  Matahari

In [30]:
type(df[['first_name', 'last_name']])

pandas.core.frame.DataFrame

## Rows and Columns

In [31]:
df.columns

Index(['first_name', 'last_name', 'age'], dtype='object')

### iloc (work with index)

In [35]:
#access one row
df.iloc[0]

first_name     Ali
last_name     Bumi
age             18
Name: 0, dtype: object

In [36]:
#acces one row with one column
df.iloc[0]['age']

18

In [39]:
#access one row with multiple columns
df.iloc[0][['first_name', 'last_name']]

first_name     Ali
last_name     Bumi
Name: 0, dtype: object

In [49]:
#access one row and one column spesificly using index
print(df.iloc[0, 0])
print(df.iloc[0, 1])
print(df.iloc[0, 2])

Ali
Bumi
18

In [66]:
#acces multiple rows
df.iloc[[0, 2]]

  first_name last_name  age
0        Ali      Bumi   18
2       Seli  Matahari   18

In [78]:
#access range of rows
df.iloc[0:2]

  first_name last_name  age
0        Ali      Bumi   18
1       Raib     Bulan   18

In [76]:
#access multiple row and one column 
df.iloc[[0, 2], 0]

0     Ali
2    Seli
Name: first_name, dtype: object

In [79]:
#access multiple row and multiple column by index
df.iloc[[0, 2], [0, 1]]

  first_name last_name
0        Ali      Bumi
2       Seli  Matahari

In [100]:
#acess multiple row and multiple column by label
df.iloc[[0, 2]][['first_name', 'last_name']]

  first_name last_name
0        Ali      Bumi
2       Seli  Matahari

In [88]:
#acess multiple row by range of index and multiple column by label
df.iloc[0:2][['first_name', 'last_name']]

  first_name last_name
0        Ali      Bumi
1       Raib     Bulan

### loc (work with label)

In [108]:
df.loc[0]

first_name     Ali
last_name     Bumi
age             18
Name: 0, dtype: object

In [109]:
df.loc[[0, 1]]

  first_name last_name  age
0        Ali      Bumi   18
1       Raib     Bulan   18

In [118]:
df.loc[[0, 1], 'age']

0    18
1    18
Name: age, dtype: int64

In [120]:
df.loc[[0, 1], ['first_name', 'age']]

  first_name  age
0        Ali   18
1       Raib   18